fe40/tutorials/rheoEFoam/ICEO/NernstPlanck/0/cCation
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ciCation;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 9.48946E-05;

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform 9.48946E-05;       
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform 9.48946E-05;       
    }
    
    cylinder
    {
	type            zeroIonicFlux;
	value           uniform 9.48946E-05;       
    }

    "wall.*"
    {
	type            zeroGradient;       
    }

    frontAndBack
    {
	type            empty;     
    }
    
}

// ************************************************************************* //
